import regex as re

TYPO_RULES = [

    (
        r"""((?:^|\s)[аА])бб?р[ие]в[ие]а""",
        r"""\1ббревиа"""
    ),

    (
        r"""((?:^|\s)[аА])бб?[ие]сс?ин""",
        r"""\1биссин"""
    ),

    (
        r"""((?:^|\s)[аА])б[ао]н[еи]мент""",
        r"""\1бонемент"""
    ),

    (
        r"""((?:^|\s)[аА])банент(а(?:ми?|х)?|[уеы]|о[вм]?)\b""",
        r"""\1бонент\2"""
    ),

    (
        r"""((?:^|\s)[аА])банир""",
        r"""\1бонир"""
    ),

    (
        r"""((?:^|\s)[аА])б[ао]р[еи]ген(а(?:ми?|х)?|[уеы]|о[вм]?)\b""",
        r"""\1бориген\2"""
    ),

    (
        r"""((?:^|\s)[аА])бб?а?рак[оа]дабр(а(?:ми?|х)?|[уые]|ой)?\b""",
        r"""\1бракадабр\2"""
    ),

    (
        r"""((?:^|\s)[аА])бсалют""",
        r"""\1бсолют"""
    ),

    (
        r"""((?:^|\s)[аА])бстрогир""",
        r"""\1бстрагир"""
    ),

    (
        r"""((?:^|\s)[аА])бс?ц([еи])сс?""",
        r"""\1бсц\2сс"""
    ),

    (
        r"""((?:^|\s)[аА])в[оа]нт?гар[тд]""",
        r"""\1вангард"""
    ),

    (
        r"""((?:^|\s)[аА])в[ие]нь?ю\b""",
        r"""\1веню"""
    ),

    (
        r"""((?:^|\s)[аА])ви[ао]\-([А-ЯЁа-яё])""",
        r"""\1виа\2"""
    ),

    (
        r"""((?:^|\s)[аА])в[аеи]цион""",
        r"""\1виацион"""
    ),

    (
        r"""((?:^|\s)[аА])в[ао]кад[оа]\b""",
        r"""\1вокадо"""
    ),

    (
        r"""((?:^|\s)[аА])вто\-([А-ЯЁа-яё])""",
        r"""\1вто\2"""
    ),

    (
        r"""((?:^|\s)[аА])глют[еи]н""",
        r"""\1гглютин"""
    ),

    (
        r"""((?:^|\s)[аА])гг?р[ие]сс?ив""",
        r"""\1грессив"""
    ),

    (
        r"""((?:^|\s)[аА])гг?ресс?и""",
        r"""\1гресси"""
    ),

    (
        r"""((?:^|\s)[аА])гг?ресс?оо?р""",
        r"""\1грессор"""
    ),

    (
        r"""((?:^|\s)[аА])гро-([А-ЯЁа-яё])""",
        r"""\1гро\2"""
    ),

    (
        r"""([аА])двакат""",
        r"""\1двокат"""
    ),

    (
        r"""([аА])дэкват""",
        r"""\1декват"""
    ),

    (
        r"""([аА])дэпт""",
        r"""\1депт"""
    ),

    (
        r"""((?:^|\s)[аА])дд?р[ие]сс?([ауеы]|о[мв]|ами?|ах)?\b""",
        r"""\1дрес\2"""
    ),

    (
        r"""((?:^|\s)[аА])дь?ютант([ауеы]|о[мв]|ами?|ах)?\b""",
        r"""\1дъютант\2"""
    ),

    (
        r"""((?:^|\s)[аА])ж[ие][ао]таж([ау]|ем?)\b""",
        r"""\1жиотаж\2"""
    ),

    (
        r"""((?:^|\s)[аА])з[еи]рб[ао]й?д?жан(ец|ц([уы]|е([мв])|а(ми?|х)?))\b""",
        r"""\1зербайджан\2"""
    ),

    (
        r"""((?:^|\s)[аА])кк?(?:ил|л[ие])мат[ие]заци""",
        r"""\1кклиматизаци"""
    ),

    (
        r"""((?:^|\s)[аА])кк?[ао]мп[ао]н[еи]мент(а(?:ми?|х)?|[уеы]|о[мв]?)\b""",
        r"""\1ккомпанемент\2"""
    ),

    (
        r"""((?:^|\s)[аА])кк?[ао]рд[еи]он([ауеы]|о[мв]|ами?|ах)?\b""",
        r"""\1ккордеон\2"""
    ),

    (
        r"""((?:^|\s)[аА])кк?[уоа]мулятор(а(?:ми?|х)?|[уеы]|о[мв]?)\b""",
        r"""\1ккумулятор\2"""
    ),

    (
        r"""((?:^|\s)[аА])куратн(ы[еймх]|ого|ому?|ая|о[ейю]|ую|ыми)\b""",
        r"""\1ккуратн\2"""
    ),

    (
        r"""((?:^|\s)[аА])ксеом(а(?:ми?)?|[уеы]|о[йю]|ах)?\b""",
        r"""\1ксиом\2"""
    ),

    (
        r"""((?:^|\s)[аА])ккуст""",
        r"""\1куст"""
    ),

    (
        r"""((?:^|\s)[аА])лл?[ие]гатор""",
        r"""\1ллигатор"""
    ),

    (
        r"""((?:^|\s)[аА])ль?б[ао]трос""",
        r"""\1льбатрос"""
    ),

    (
        r"""((?:^|\s)[аА])лл?юмин[ие]в""",
        r"""\1люминиев"""
    ),

    (
        r"""((?:^|\s)[аА])мплетуд""",
        r"""\1мплитуд"""
    ),

    (
        r"""((?:^|\s)[аА])глийск""",
        r"""\1нглийск"""
    ),

    (
        r"""((?:^|\s)[аА])пп?[еи]лл?яци""",
        r"""\1пелляци"""
    ),

    (
        r"""((?:^|\s)[аА])пп?[ао]рат""",
        r"""\1ппарат"""
    ),

    (
        r"""((?:^|\s)[аА])пп?[ие]нд[еи]цит(а(?:ми?|х)?|[уеы]|о[мв]?)\b""",
        r"""\1ппендицит\2"""
    ),

    (
        r"""([аА])реал([А-ЯЁа-яё]{0,3})\s(обита|распр?остране)ния""",
        r"""\1реал\2"""
    ),

    (
        r"""([аА])ртифакт""",
        r"""\1ртефакт"""
    ),

    (
        r"""([аА])ртеллери""",
        r"""\1ртиллери"""
    ),

    (
        r"""([аА])рьегард""",
        r"""\1рьергард"""
    ),

    (
        r"""([аА])ссимм?етри""",
        r"""\1симметри"""
    ),

    (
        r"""([аА])ссимптот""",
        r"""\1симптот"""
    ),

    (
        r"""((?:^|\s)[аА])сс?[еи]стент""",
        r"""\1ссистент"""
    ),

    (
        r"""([,\.])\s*([аА])\sтак([\s-])же\b""",
        r"""\1 \2 также"""
    ),

    (
        r"""((?:^|\s)[аА])тт?р[еи]бу([тц])""",
        r"""\1трибу\2"""
    ),

    (
        r"""([бБ])арикад""",
        r"""\1аррикад"""
    ),

    (
        r"""((?:^|\s)[бБ])езопастн""",
        r"""\1езопасн"""
    ),

    (
        r"""((?:^|\s)[бБ])изнесс\b""",
        r"""\1изнес"""
    ),

    (
        r"""((?:^|\s)[бБ])лаг[оа]доря\b""",
        r"""\1лагодаря"""
    ),

    (
        r"""((?:^|\s)[бБ])лиз?жай?[шщ]""",
        r"""\1лижайш"""
    ),

    (
        r"""((?:^|\s)[бБ])лизлежай?[шщ]""",
        r"""\1лизлежащ"""
    ),

    (
        r"""((?:^|\s)[бБ])огодельн""",
        r"""\1огадельн"""
    ),

    (
        r"""((?:^|\s)б)рэнд([ауеы]|о[мв]|ами?|ах|инг[А-ЯЁа-яё]{0,5})?\b""",
        r"""\1ренд\2"""
    ),

    (
        r"""((?:^|\s)[бБ])ритпоп""",
        r"""\1рит-поп"""
    ),

    (
        r"""((?:^|\s)[бБ])удую[шщ]""",
        r"""\1удущ"""
    ),

    (
        r"""((?:^|\s)[бБ])ъеф""",
        r"""\1ьеф"""
    ),

    (
        r"""((?:^|\s)[бБ])ывшы""",
        r"""\1ывши"""
    ),

    (
        r"""((?:^|\s)[вВ])виде\b""",
        r"""\1 виде"""
    ),

    (
        r"""((?:^|\s)[вВ])\-?оо?бщем\b""",
        r"""\1 общем"""
    ),

    (
        r"""((?:^|\s)[вВ])\s?отличии\sот""",
        r"""\1 отличие от"""
    ),

    (
        r"""((?:^|\s)[вВ])\sпредверии\b""",
        r"""\1 преддверии"""
    ),

    (
        r"""((?:^|\s)[вВ])связи\b""",
        r"""\1 связи"""
    ),

    (
        r"""([вВ])силу""",
        r"""\1 силу"""
    ),

    (
        r"""((?:^|\s)[вВ])\s?течении\s(времени|секунды?|минуты?|часа|дня|суток|недели|месяца|года|десятилетия|период(а|ов))\b""",
        r"""\1 течение \2"""
    ),

    (
        r"""((?:^|\s)[вВ])\s?тоже\s?время\b""",
        r"""\1 то же время"""
    ),

    (
        r"""((?:^|\s)[вВ])целом\b""",
        r"""\1 целом"""
    ),

    (
        r"""((?:^|\s)[вВ])эб""",
        r"""\1еб"""
    ),

    (
        r"""((?:^|\s)[вВ])етренн""",
        r"""\1етрен"""
    ),

    (
        r"""((?:^|\s)[вВ])зыма""",
        r"""\1зима"""
    ),

    (
        r"""((?:^|\s)[вВ])\s?кратци?[еи]""",
        r"""\1кратце"""
    ),

    (
        r"""((?:^|\s)[вВ])оенн?оначальник""",
        r"""\1оеначальник"""
    ),

    (
        r"""((?:^|\s)[вВ])оенниз""",
        r"""\1оениз"""
    ),

    (
        r"""((?:^|\s)[вВ])озрен""",
        r"""\1оззрен"""
    ),

    (
        r"""([вВ])\sплоть\sдо""",
        r"""\1плоть до"""
    ),

    (
        r"""((?:^|\s)[вВ])\sпол-?оборота""",
        r"""\1полоборота"""
    ),

    (
        r"""((?:^|\s)[вВ])\s?последстви[еи]""",
        r"""\1последствии"""
    ),

    (
        r"""((?:^|\s)[вВ])\sразрез(?=\sс)""",
        r"""\1разрез"""
    ),

    (
        r"""((?:^|\s)[вВ])\s?ря[дт]\s?ли\b""",
        r"""\1ряд ли"""
    ),

    (
        r"""((?:^|\s)[вВ])с[её]-же\b""",
        r"""\1сё же"""
    ),

    (
        r"""((?:^|\s)[вВ])\sследствии\sчего\b""",
        r"""\1следствие чего"""
    ),

    (
        r"""((?:^|\s)[вВ])следствии""",
        r"""\1следствие"""
    ),

    (
        r"""((?:^|\s)[гГ])алл?[еи]ре""",
        r"""\1алере"""
    ),

    (
        r"""((?:^|\s)[гГ])аупвахт""",
        r"""\1ауптвахт"""
    ),

    (
        r"""([гГ])енеолог""",
        r"""\1енеалог"""
    ),

    (
        r"""([гГ])ермити""",
        r"""\1ермети"""
    ),

    (
        r"""((?:^|\s)[гГ])иганст?к""",
        r"""\1игантск"""
    ),

    (
        r"""((?:^|\s)[гГ])остинниц""",
        r"""\1остиниц"""
    ),

    (
        r"""([гГ])оссударств""",
        r"""\1осударств"""
    ),

    (
        r"""([гГ])осударствен(?!е?н)""",
        r"""\1осударственн"""
    ),

    (
        r"""((?:^|\s)[гГ])раммотн""",
        r"""\1рамотн"""
    ),

    (
        r"""((?:^|\s)[дД])вояко[-\s]зубчат""",
        r"""\1воякозубчат"""
    ),

    (
        r"""((?:^|\s)[дД])вухглав""",
        r"""\1вуглав"""
    ),

    (
        r"""((?:^|\s)[дД])вухкратн""",
        r"""\1вукратн"""
    ),

    (
        r"""((?:^|\s)[дД])вухличн""",
        r"""\1вуличн"""
    ),

    (
        r"""((?:^|\s)[Нн]ед|[дД])вухсмысленн""",
        r"""\1вусмысленн"""
    ),

    (
        r"""((?:^|\s)[дД])вухчлен""",
        r"""\1вучлен"""
    ),

    (
        r"""((?:^|\s)[дД])вухъ?язычн""",
        r"""\1вуязычн"""
    ),

    (
        r"""((?:^|\s)[дД])емо-запис""",
        r"""\1емозапис"""
    ),

    (
        r"""((?:^|\s)[дД])еревян(ы[еймх]|ого|ому?|ая|о[ейю]|ую|ыми?)\b""",
        r"""\1еревянн\2"""
    ),

    (
        r"""([дД])ифицит""",
        r"""\1ефицит"""
    ),

    (
        r"""((?:^|\s)[дД])иаграм(а(?:ми?|х)?|[ыуе]|ой)?\b""",
        r"""\1иаграмм\2"""
    ),

    (
        r"""((?:^|\s)[дД])и-дже""",
        r"""\1идже"""
    ),

    (
        r"""((?:^|\s)[дД])илл?[еи]р""",
        r"""\1илер"""
    ),

    (
        r"""((?:^|\s)[дД])[еи]скр[еи]д[еи]т""",
        r"""\1искредит"""
    ),

    (
        r"""((?:^|\s)[дД])истрибьюц""",
        r"""\1истрибуц"""
    ),

    (
        r"""((?:^|\s)[дД])обовл""",
        r"""\1обавл"""
    ),

    (
        r"""((?:^|\s)[дД])остиженн""",
        r"""\1остижен"""
    ),

    (
        r"""((?:^|\s)[еЕ])дениц(а(?:ми?|х)?|[уы]|ей?)?\b""",
        r"""\1диниц\2"""
    ),

    (
        r"""ё́""",
        r"""ё"""
    ),

    (
        r"""((?:^|\s)[жЖ])[иы]хн""",
        r"""\1изн"""
    ),

    (
        r"""((?:^|\s)(?:[сС]л|[зЗ]ав))еду[шщ]""",
        r"""\1ледующ"""
    ),

    (
        r"""((?:^|\s)[зЗ])арегестр""",
        r"""\1арегистр"""
    ),

    (
        r"""((?:^|\s)[зЗ])емл[еия]тр[еия]сени""",
        r"""\1емлетрясени"""
    ),

    (
        r"""((?:^|\s)[иИ])йти\b""",
        r"""\1дти"""
    ),

    (
        r"""((?:^|\s)[иИ])зготовлива([ею])т""",
        r"""\1зготовля\2т"""
    ),

    (
        r"""((?:^|\s)[иИ]ме(ют?|е[тм]|л[аои]?|ющ[А-ЯЁа-яё]{2,3}|вш[А-ЯЁа-яё]{1,3}|[вя])(с[яь]?))\sввиду\b""",
        r"""\1 в виду"""
    ),

    (
        r"""((?:^|\s)[иИ])мм?итац""",
        r"""\1митац"""
    ),

    (
        r"""((?:^|\s)[иИ])мм?плантант([еыу]|а(?:ми?|х)?|о[мв]?)\b""",
        r"""\1мплантат\2"""
    ),

    (
        r"""([иИ])нгридиент""",
        r"""\1нгредиент"""
    ),

    (
        r"""((?:^|\s)[иИ])нжи?нер(а(?:ми?|х)?|[уеы]|о[вм]|н[А-ЯЁа-яё]{1,3})?\b""",
        r"""\1нженер\2"""
    ),

    (
        r"""((?:^|\s)[иИ])нтер?(?:гр|рг)ац""",
        r"""\1нтеграц"""
    ),

    (
        r"""((?:^|\s)[иИ])нт[еи]рест?""",
        r"""\1нтерес"""
    ),

    (
        r"""([иИ])нфецирр?""",
        r"""\1нфицир"""
    ),

    (
        r"""((?:^|\s)[иИ])нц[ие]н?дент([уеы]|а(?:ми?|х)?|о[мв]?)\b""",
        r"""\1нцидент\2"""
    ),

    (
        r"""((?:^|\s)[иИ])сс?кусс?тв([уе]|а(?:ми?|х)?|ом?)?\b""",
        r"""\1скусств\2"""
    ),

    (
        r"""((?:^|\s)[иИ])сполнен(ы[еймх]|ого|ому?|ая|о[ейю]|ую|ыми?)\b""",
        r"""\1сполненн\2"""
    ),

    (
        r"""((?:^|\s)[иИ])следова""",
        r"""\1сследова"""
    ),

    (
        r"""((?:^|\s)[кК])ак-будто\b""",
        r"""\1ак будто"""
    ),

    (
        r"""((?:^|\s)[кК])[ао]т[оа]строф""",
        r"""\1атастроф"""
    ),

    (
        r"""((?:^|\s)[кК])[ие]лл?[ао]грам(а(?:ми?|х)?|[уеы]|о[вм]?)\b""",
        r"""\1илограмм\2"""
    ),

    (
        r"""((?:^|\s)[кК])илл?омм?етр""",
        r"""\1илометр"""
    ),

    (
        r"""((?:^|\s)[Кк])ировобад""",
        r"""\1ировабад"""
    ),

    (
        r"""((?:^|\s)[кК])липпер(?![ст])""",
        r"""\1липер"""
    ),

    (
        r"""((?:^|\s)[кК])люч[её]м\b""",
        r"""\1лючом"""
    ),

    (
        r"""((?:^|\s)[кК])[оа]лл?ич[ие][ст][тс]?вт?""",
        r"""\1оличеств"""
    ),

    (
        r"""((?:^|\s)[кК])олеги""",
        r"""\1оллеги"""
    ),

    (
        r"""((?:^|\s)[кК])олекци""",
        r"""\1оллекци"""
    ),

    (
        r"""((?:^|\s)[кК])омманд(?!ос|о\b|ер|ит)""",
        r"""\1оманд"""
    ),

    (
        r"""((?:^|\s)[оО]бщек|[кК])омм?анд(ы[еймх]|ого|ому?|ая|о[ейю]|ую|ыми?)\b""",
        r"""\1оманд\2"""
    ),

    (
        r"""((?:^|\s)[кК])омм?иси""",
        r"""\1омисси"""
    ),

    (
        r"""((?:^|\s)[кК])омм?[еи]нтари""",
        r"""\1омментари"""
    ),

    (
        r"""((?:^|\s)[кК])онвеер""",
        r"""\1онвейер"""
    ),

    (
        r"""([кК])орресподен""",
        r"""\1орреспонден"""
    ),

    (
        r"""((?:^|\s)[кК])ороновирус""",
        r"""\1оронавирус"""
    ),

    (
        r"""((?:^|\s)[кК])(?:тор|тоор|отр|оотр|отро)(ая|о[геймю]|[уы])""",
        r"""\1отор\2"""
    ),

    (
        r"""((?:^|\s)[кК])офе-машин\b""",
        r"""\1офемашин"""
    ),

    (
        r"""((?:^|\s)[лЛ])а[дн]{1,2}шафт""",
        r"""\1андшафт"""
    ),

    (
        r"""([лЛ])егетимн""",
        r"""\1егитимн"""
    ),

    (
        r"""((?:^|\s)[лЛ])ей?т[еий]нн?ат?н?т""",
        r"""\1ейтенант"""
    ),

    (
        r"""((?:^|\s)[лЛ])ибретист""",
        r"""\1ибреттист"""
    ),

    (
        r"""((?:^|\s)(?:([Нн]аи)?)([лЛ])у([дшщ][шщ]|чщ))""",
        r"""\1\3учш"""
    ),

    (
        r"""((?:^|\s)[Мм])ал([А-ЯЁа-яё]{2,3}\s)Театр""",
        r"""\1ал\2театр"""
    ),

    (
        r"""((?:^|\s)[Мм])орокк""",
        r"""\1арокк"""
    ),

    (
        r"""((?:^|\s)[Мм])асс?ачусетт?с""",
        r"""\1ассачусетс"""
    ),

    (
        r"""([мМ])еждку?""",
        r"""\1ежду"""
    ),

    (
        r"""((?:^|\s)[мМ])еждун[ао]рож?(?:ндн?|дн)""",
        r"""\1еждународн"""
    ),

    (
        r"""((?:^|\s)[мМ])эйнфр[еэ]йм""",
        r"""\1ейнфрейм"""
    ),

    (
        r"""((?:^|\s)[мМ])еллиора""",
        r"""\1елиора"""
    ),

    (
        r"""((?:^|\s)[мМ])еридианал""",
        r"""\1еридионал"""
    ),

    (
        r"""((?:^|\s)[мМ])есяцом\b""",
        r"""\1есяцем"""
    ),

    (
        r"""((?:^|\s)[мМ])илион""",
        r"""\1иллион"""
    ),

    (
        r"""((?:^|\s)[мМ])илиард""",
        r"""\1иллиард"""
    ),

    (
        r"""((?:^|\s)[мМ])инестер""",
        r"""\1инистер"""
    ),

    (
        r"""((?:^|\s)[мМ])одет\b""",
        r"""\1ожет"""
    ),

    (
        r"""([мМ])олл?екулл?""",
        r"""\1олекул"""
    ),

    (
        r"""((?:^|\s)[мМ])оностыр""",
        r"""\1онастыр"""
    ),

    (
        r"""((?:^|\s)[мМ])ульфильм""",
        r"""\1ультфильм"""
    ),

    (
        r"""((?:^|\s)[мМ])ученник""",
        r"""\1ученик"""
    ),

    (
        r"""((?:^|\s)[нН])азванн([А-ЯЁа-яё]?)\b""",
        r"""\1азван\2"""
    ),

    (
        r"""((?:^|\s)[нН])азвн?анн?и([еяюий]|[ея]ми?|ях)\b""",
        r"""\1азвани\2"""
    ),

    (
        r"""((?:^|\s)[нН])аичаще""",
        r"""\1аиболее часто"""
    ),

    (
        r"""((?:^|\s)[нН])а(пир|рпи)мер\b""",
        r"""\1апример"""
    ),

    (
        r"""((?:^|\s)[нН])а\s?протяжение\b""",
        r"""\1а протяжении"""
    ),

    (
        r"""((?:^|\s)[нН])а\sряду\sс""",
        r"""\1аряду с"""
    ),

    (
        r"""([нН])астояш""",
        r"""\1астоящ"""
    ),

    (
        r"""((?:^|\s)[нН])ачил""",
        r"""\1ачал"""
    ),

    (
        r"""((?:^|\s)[нН])е(?:рв|вр)[оа]п[оа]толог""",
        r"""\1европатолог"""
    ),

    (
        r"""((?:^|\s)[нН])[ие]ль?зя\b""",
        r"""\1ельзя"""
    ),

    (
        r"""((?:^|\s)[нН])[еи]\sкогда\sне\b""",
        r"""\1икогда не"""
    ),

    (
        r"""((?:^|\s)[нН])инзя\b""",
        r"""\1индзя"""
    ),

    (
        r"""((?:^|\s)[нН])овелист""",
        r"""\1овеллист"""
    ),

    (
        r"""((?:^|\s)[нН])ьюанс""",
        r"""\1юанс"""
    ),

    (
        r"""((?:^|\s)[оО])листвен""",
        r"""\1блиствен"""
    ),

    (
        r"""((?:^|\s)[оО])бмен[её]н(н|\b)""",
        r"""\1бменян\2"""
    ),

    (
        r"""((?:^|\s)[оО])бого(щ|ти)""",
        r"""\1бога\2"""
    ),

    (
        r"""([оО])братно-(ланцетн|яйцевидн)""",
        r"""\1братно\2"""
    ),

    (
        r"""((?:^|\s)[оО])б[ьъ]ед[ие]нен""",
        r"""\1бъединен"""
    ),

    (
        r"""((?:^|\s)[оО])бьеди""",
        r"""\1бъеди"""
    ),

    (
        r"""((?:^|\s)[оО])бьект""",
        r"""\1бъект"""
    ),

    (
        r"""((?:^|\s)[оО])обстаятельств(а(?:ми?|х)?|у|о[вм]|е)?\b""",
        r"""\1бстоятельств\2"""
    ),

    (
        r"""((?:^|\s)[оО])данко\b""",
        r"""\1днако"""
    ),

    (
        r"""((?:^|\s)[оО])канчател""",
        r"""\1кончател"""
    ),

    (
        r"""((?:^|\s)[оО])кресност""",
        r"""\1крестност"""
    ),

    (
        r"""((?:^|\s)[оО])ловян(?![нищ])""",
        r"""\1ловянн"""
    ),

    (
        r"""((?:^|\s)[оО])рганизва""",
        r"""\1рганизова"""
    ),

    (
        r"""((?:^|\s)[оО])рганизвц""",
        r"""\1рганизац"""
    ),

    (
        r"""((?:^|\s)[оО])ргинал""",
        r"""\1ригинал"""
    ),

    (
        r"""((?:^|\s)[оО])рент""",
        r"""\1риент"""
    ),

    (
        r"""((?:^|\s)[оО])снованн([А-ЯЁа-яё]?)\b""",
        r"""\1снован\2"""
    ),

    (
        r"""((?:^|\s)[оО])сновывет""",
        r"""\1сновывает"""
    ),

    (
        r"""((?:^|\s)[оО])тсальн""",
        r"""\1стальн"""
    ),

    (
        r"""((?:^|\s)[оО])о?(?:тс|ст)ров\b""",
        r"""\1стров"""
    ),

    (
        r"""((?:^|\s)[оО])ффис""",
        r"""\1фис"""
    ),

    (
        r"""((?:^|\s)[оО])ффицер""",
        r"""\1фицер"""
    ),

    (
        r"""((?:^|\s)[оОаА])фф?[еи]ц[еи]?альн""",
        r"""\1фициальн"""
    ),

    (
        r"""([пП])арано([яиею]|ей)\b""",
        r"""\1араной\2"""
    ),

    (
        r"""([пП])арно[-\s]перист""",
        r"""\1арноперист"""
    ),

    (
        r"""((?:^|\s)[пП])[оа]р[оа][шщ]ут(а(?:ми?|х)?|[еуы]|о[мв]?)\b""",
        r"""\1арашют\2"""
    ),

    (
        r"""((?:^|\s)[Пп])елл?опп?онн?ес""",
        r"""\1елопоннес"""
    ),

    (
        r"""((?:^|\s)[Пп])еннсиль?ван""",
        r"""\1енсильван"""
    ),

    (
        r"""((?:^|\s)[пП])ерепес([ьи]|ью|ей|ями?|ях)\b""",
        r"""\1ерепис\2"""
    ),

    (
        r"""((?:^|\s)[пП])ерефери""",
        r"""\1ерифери"""
    ),

    (
        r"""([пП])[еи]т[еи]рбу[рг]ск""",
        r"""\1етербургск"""
    ),

    (
        r"""([пП])ревоначаль""",
        r"""\1ервоначаль"""
    ),

    (
        r"""((?:^|\s)[пП])[еи]реодическ""",
        r"""\1ериодическ"""
    ),

    (
        r"""((?:^|\s)[пП])лей-лист""",
        r"""\1лейлист"""
    ),

    (
        r"""((?:^|\s)[пП])о\sистечению""",
        r"""\1о истечении"""
    ),

    (
        r"""((?:^|\s)[пП])о-умолчанию""",
        r"""\1о умолчанию"""
    ),

    (
        r"""([пП])оддан([^сн])""",
        r"""\1одданн\2"""
    ),

    (
        r"""((?:^|\s)[пП])о(хж|жз)е""",
        r"""\1озже"""
    ),

    (
        r"""((?:^|\s)[пП])озноват""",
        r"""\1ознават"""
    ),

    (
        r"""((?:^|\s)[пП])ол(у?)([-\s])года\b""",
        r"""\1ол\2года"""
    ),

    (
        r"""((?:^|\s)[пП])[оа]мо[шщ]ник(а(?:ми?|х)?|[уеи]|о[мв]?)\b""",
        r"""\1омощник\2"""
    ),

    (
        r"""((?:^|\s)[пП])[оа]рут?чч?ик""",
        r"""\1оручик"""
    ),

    (
        r"""((?:^|\s)[пП])одскользн""",
        r"""\1оскользн"""
    ),

    (
        r"""((?:^|\s)[пП])одчерк(?![ин])""",
        r"""\1очерк"""
    ),

    (
        r"""((?:^|\s)[пП])очтампт""",
        r"""\1очтамт"""
    ),

    (
        r"""((?:^|\s)[пП])рвао\b""",
        r"""\1раво"""
    ),

    (
        r"""((?:^|\s)[пП])редпренимател""",
        r"""\1редпринимател"""
    ),

    (
        r"""((?:^|\s)[пП])редставля([А-ЯЁа-яё]{1,7})\sиз\sсебя\b""",
        r"""\1редставля\2 собой"""
    ),

    (
        r"""((?:^|\s)[пП])реди(дущ|стори)""",
        r"""\1реды\2"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи]з[еи]нтац""",
        r"""\1резентац"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи]з[еи]дент""",
        r"""\1резидент"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи][еий]му[шщ]еств""",
        r"""\1реимуществ"""
    ),

    (
        r"""((?:^|\s)[пП])рислед""",
        r"""\1реслед"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи]ц[ие]н?дент([уеы]|а(?:ми?|х)?|о[мв]?)\b""",
        r"""\1рецедент\2"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи]бл[еи]([зж])""",
        r"""\1рибли\2"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи]в[еи]лег""",
        r"""\1ривилег"""
    ),

    (
        r"""((?:^|\s)[пП])ревык""",
        r"""\1ривык"""
    ),

    (
        r"""((?:^|\s)[пП])рийдя\b""",
        r"""\1ридя"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи]емлим""",
        r"""\1риемлем"""
    ),

    (
        r"""((?:^|\s)[пП])ридти\b""",
        r"""\1рийти"""
    ),

    (
        r"""((?:^|\s)[пП])ренадлеж""",
        r"""\1ринадлеж"""
    ),

    (
        r"""((?:^|\s)[пП])рисваев""",
        r"""\1рисваив"""
    ),

    (
        r"""((?:^|\s)[пП])рисва[еи]м""",
        r"""\1рисваиваем"""
    ),

    (
        r"""([пП])рисут?ст?вт?в?""",
        r"""\1рисутств"""
    ),

    (
        r"""((?:^|\s)[пП])робыва""",
        r"""\1робова"""
    ),

    (
        r"""((?:^|\s)[пП])ровакац""",
        r"""\1ровокац"""
    ),

    (
        r"""((?:^|\s)[пП])родюссер""",
        r"""\1родюсер"""
    ),

    (
        r"""((?:^|\s)[пП])роис?шест?в""",
        r"""\1роисшеств"""
    ),

    (
        r"""((?:^|\s)[пП])роэкт""",
        r"""\1роект"""
    ),

    (
        r"""((?:^|\s)[пП])ромо-(акци|материал|менеджер|реклам|тур)""",
        r"""\1ромо\2"""
    ),

    (
        r"""((?:^|\s)[пП])рофф?есс?ор([уеы]|а(?:ми?|х)?|о[мв]?)\b""",
        r"""\1рофессор\2"""
    ),

    (
        r"""((?:^|\s)[пП])рофф?есс?оры\b""",
        r"""\1рофессора"""
    ),

    (
        r"""((?:^|\s)[пП])сихиатор""",
        r"""\1сихиатр"""
    ),

    (
        r"""((?:^|\s)[пП])ъесс?""",
        r"""\1ьес"""
    ),

    (
        r"""((?:^|\s)[рР])азведов""",
        r"""\1азведыв"""
    ),

    (
        r"""но{3,4}браз""",
        r"""нообраз"""
    ),

    (
        r"""([рР])а[ий]{1,2}сполком""",
        r"""\1айисполком"""
    ),

    (
        r"""((?:^|\s)[рР])ассов(?![ае]т|ыв)""",
        r"""\1асов"""
    ),

    (
        r"""([рР])асс?пал""",
        r"""\1аспал"""
    ),

    (
        r"""([рР])аспознов""",
        r"""\1аспознав"""
    ),

    (
        r"""([рР])асс?п[ао]л[ао]г""",
        r"""\1асполаг"""
    ),

    (
        r"""([рР])асс?п[ао]ло([жг])""",
        r"""\1асполо\2"""
    ),

    (
        r"""([рР])аспр?остран""",
        r"""\1аспростран"""
    ),

    (
        r"""((?:^|\s)[рР])астоян""",
        r"""\1асстоян"""
    ),

    (
        r"""((?:^|\s)[рР])ейтигн?""",
        r"""\1ейтинг"""
    ),

    (
        r"""((?:^|\s)(?:([Пп]ерв|[Вв]тор|[Тт]рет|[Чч]етв[её]рт|[1-4]-?))[А-ЯЁа-яё]{1,4}\s)Р[еэ]йх""",
        r"""\1рейх"""
    ),

    (
        r"""([рР])екомменд""",
        r"""\1екоменд"""
    ),

    (
        r"""((?:^|\s)[рР])[еи]м[еэ]йк""",
        r"""\1емейк"""
    ),

    (
        r"""((?:^|\s)[рР])енген""",
        r"""\1ентген"""
    ),

    (
        r"""([рР])оссиийск""",
        r"""\1оссийск"""
    ),

    (
        r"""((?:^|\s)[рР])[эе]ппер""",
        r"""\1эпер"""
    ),

    (
        r"""((?:^|\s)[сС])аксафон""",
        r"""\1аксофон"""
    ),

    (
        r"""((?:^|\s)[сС])аундпродюсер""",
        r"""\1аунд-продюсер"""
    ),

    (
        r"""((?:^|\s)[сС])аунд-тр[еэ]к""",
        r"""\1аундтрек"""
    ),

    (
        r"""((?:^|\s)[сС])аунд-чек""",
        r"""\1аундчек"""
    ),

    (
        r"""((?:^|\s)[сС])(верх|низ)у-в(низ|верх)""",
        r"""\1\2у в\3"""
    ),

    (
        r"""((?:^|\s)[сС])веого\b""",
        r"""\1воего"""
    ),

    (
        r"""((?:^|\s)[сС])делан(ы[еймх]|ого|ому?|ая|о[ейю]|ую|ыми?)\b""",
        r"""\1деланн\2"""
    ),

    (
        r"""((?:^|\s)[сС])[еи][гв]о(ндя|дян)\b""",
        r"""\1егодня"""
    ),

    (
        r"""((?:^|\s)[сС])егодн[еи]шн""",
        r"""\1егодняшн"""
    ),

    (
        r"""((?:^|\s)[сС])еребрянн(?!и)""",
        r"""\1еребрян"""
    ),

    (
        r"""((?:^|\s)[сС])еридин""",
        r"""\1ередин"""
    ),

    (
        r"""((?:^|\s)[сС])[еи]р[еи]ал([уеы]|а(?:ми?|х)?|о[вм]?)\b""",
        r"""\1ериал\2"""
    ),

    (
        r"""((?:^|\s)[сС])етлист""",
        r"""\1ет-лист"""
    ),

    (
        r"""((?:^|\s)[сС])каннер""",
        r"""\1канер"""
    ),

    (
        r"""((?:^|\s)[сС])(ле|пра)в[ао][-\s]на(пра|ле)в[оа]""",
        r"""\1\2ва на\3во"""
    ),

    (
        r"""((?:^|\s)[сС])лэнг""",
        r"""\1ленг"""
    ),

    (
        r"""((?:^|\s)[сС])начало""",
        r"""\1начала"""
    ),

    (
        r"""((?:^|\s)[сС])овавтор""",
        r"""\1оавтор"""
    ),

    (
        r"""((?:^|\s)[сС])овмесн""",
        r"""\1овместн"""
    ),

    (
        r"""((?:^|\s)[сС])оеден""",
        r"""\1оедин"""
    ),

    (
        r"""((?:^|\s)[сС])ожеле""",
        r"""\1ожале"""
    ),

    (
        r"""((?:^|\s)[сС])остов([ли])""",
        r"""\1остав\2"""
    ),

    (
        r"""((?:^|\s)[сС])остовш""",
        r"""\1остоявш"""
    ),

    (
        r"""((?:^|\s)[сС])очита""",
        r"""\1очета"""
    ),

    (
        r"""((?:^|\s)[сС])пецефф?ект""",
        r"""\1пецэффект"""
    ),

    (
        r"""((?:^|\s)[сС])пецеф""",
        r"""\1пециф"""
    ),

    (
        r"""((?:^|\s)[сС])ссылк(ам?и?|ах|[еиу]|о[йк])\b""",
        r"""\1сылк\2"""
    ),

    (
        r"""((?:^|\s)[сС])теклян(?![нк]|ист)""",
        r"""\1теклянн"""
    ),

    (
        r"""([сС])териотип""",
        r"""\1тереотип"""
    ),

    (
        r"""((?:^|\s)[сС])тоимоть""",
        r"""\1тоимость"""
    ),

    (
        r"""((?:^|\s)[сС])триммер""",
        r"""\1тример"""
    ),

    (
        r"""((?:^|\s)[сС])тудентческ""",
        r"""\1туденческ"""
    ),

    (
        r"""((?:^|\s)[сС])ъэконом""",
        r"""\1эконом"""
    ),

    (
        r"""((?:^|\s)[тТ])[ао][вф]т[ао]лог""",
        r"""\1автолог"""
    ),

    (
        r"""((?:^|\s)[Тт])айланд\b""",
        r"""\1аиланд"""
    ),

    (
        r"""((?:^|\s)[тТ])ем\sни\s?менее?\b""",
        r"""\1ем не менее"""
    ),

    (
        r"""((?:^|\s)[тТ])ерракт""",
        r"""\1еракт"""
    ),

    (
        r"""((?:^|\s)[тТ])ерасс""",
        r"""\1еррас"""
    ),

    (
        r"""((?:^|\s)[тТ])ерр?[еи]тори""",
        r"""\1ерритори"""
    ),

    (
        r"""((?:^|\s)[тТ])оплев""",
        r"""\1оплив"""
    ),

    (
        r"""((?:^|\s)[тТ])ормазн""",
        r"""\1ормозн"""
    ),

    (
        r"""((?:^|\s)[тТ])(о(?:т|го)|а|е(?:м[и]?|х)?)-?же\b""",
        r"""\1\2 же"""
    ),

    (
        r"""((?:^|\s)[тТ])раффик""",
        r"""\1рафик"""
    ),

    (
        r"""([тТ])ренеровк""",
        r"""\1ренировк"""
    ),

    (
        r"""((?:^|\s)[тТ])ретьий\b""",
        r"""\1ретий"""
    ),

    (
        r"""((?:^|\s)[тТ])рети([хм])\b""",
        r"""\1ретьи\2"""
    ),

    (
        r"""((?:^|\s)[тТ])ретяя\b""",
        r"""\1ретья"""
    ),

    (
        r"""((?:^|\s)[тТ])ретее\b""",
        r"""\1ретье"""
    ),

    (
        r"""((?:^|\s)[тТ])рете(го|м)\b""",
        r"""\1ретье\2"""
    ),

    (
        r"""([тТ])ройчато[-\s]рассеч""",
        r"""\1ройчаторассеч"""
    ),

    (
        r"""((?:^|\s)[тТ])руженник""",
        r"""\1руженик"""
    ),

    (
        r"""((?:^|\s)[тТ])ыс[ие]ч""",
        r"""\1ысяч"""
    ),

    (
        r"""((?:^|\s)[тТ])ысячилети""",
        r"""\1ысячелети"""
    ),

    (
        r"""((?:^|\s)[тТ])с?[чщ]?ательн""",
        r"""\1щательн"""
    ),

    (
        r"""([уУ])зко[-\s](эллиптическ|ланцетн|яйцевидн|линейн|цилиндр|треугольн|ромбическ)""",
        r"""\1зко\2"""
    ),

    (
        r"""((?:^|\s)[уУ])длинн""",
        r"""\1длин"""
    ),

    (
        r"""([уУ])достоин""",
        r"""\1достоен"""
    ),

    (
        r"""((?:^|\s)[уУ])чавств""",
        r"""\1частв"""
    ),

    (
        r"""((?:^|\s)[уУ])чере""",
        r"""\1чре"""
    ),

    (
        r"""((?:^|\s)[фФ])едирац""",
        r"""\1едерац"""
    ),

    (
        r"""((?:^|\s)[фФ])ектова""",
        r"""\1ехтова"""
    ),

    (
        r"""([Фф])илл?ипп?ин""",
        r"""\1илиппин"""
    ),

    (
        r"""((?:^|\s)[фФ])илл?осс?ов""",
        r"""\1илософ"""
    ),

    (
        r"""((?:^|\s)[фФ])иннск""",
        r"""\1инск"""
    ),

    (
        r"""((?:^|\s)[фФ])рагмен([^т])""",
        r"""\1рагмент\2"""
    ),

    (
        r"""((?:^|\s)[фФ])рагмет""",
        r"""\1рагмент"""
    ),

    (
        r"""([фФ])у[нке]ци([яеийюо])""",
        r"""\1ункци\2"""
    ),

    (
        r"""((?:^|\s)[хХ])эви-""",
        r"""\1еви-"""
    ),

    (
        r"""([цЦ])ельно\-?крайни""",
        r"""\1ельнокрайны"""
    ),

    (
        r"""([цЦ])ельно\-?крайне""",
        r"""\1ельнокрайно"""
    ),

    (
        r"""([цЦ])ельно\-?крайняя""",
        r"""\1ельнокрайная"""
    ),

    (
        r"""((?:^|\s)[цЦ])е[тн]р(?!ари|ил)""",
        r"""\1ентр"""
    ),

    (
        r"""((?:^|\s)[цЦ])[еи]лл?индр""",
        r"""\1илиндр"""
    ),

    (
        r"""((?:^|\s)[чЧ])ео?лвек""",
        r"""\1еловек"""
    ),

    (
        r"""((?:^|\s)[чЧ])етыре?мя""",
        r"""\1етырьмя"""
    ),

    (
        r"""((?:^|\s)[чЧ])ерезвычайн""",
        r"""\1резвычайн"""
    ),

    (
        r"""((?:^|\s)[чЧ])то\sк[ао]саемо\b""",
        r"""\1то касается"""
    ),

    (
        r"""([чЧ])уй?ств""",
        r"""\1увств"""
    ),

    (
        r"""[Щщ]ве(й?)ц""",
        r"""Шве\1ц"""
    ),

    (
        r"""([шШ])ироко[\-\s](эллиптическ|обратно|ланцетн|яйцевидн|линейн|цилиндр|треугольн|ромбическ)""",
        r"""\1ироко\2"""
    ),

    (
        r"""((?:^|\s)[шШ])трих-код""",
        r"""\1трихкод"""
    ),

    (
        r"""([Шш])туттгарт""",
        r"""\1тутгарт"""
    ),

    (
        r"""((?:^|\s)[эЭ])ксп[еи]диц[иы]""",
        r"""\1кспедици"""
    ),

    (
        r"""ксперемент""",
        r"""ксперимент"""
    ),

    (
        r"""((?:^|\s)[эЭ])кстримал""",
        r"""\1кстремал"""
    ),

    (
        r"""((?:^|\s)[эЭ])лл[еи]гантн""",
        r"""\1легантн"""
    ),

    (
        r"""([эЭ])лл?ектрофи?((?:ка)?ц[А-ЯЁа-яё]{1,10})\b""",
        r"""\1лектрифи\2"""
    ),

    (
        r"""((?:^|\s)[эЭ])лектронник""",
        r"""\1лектроник"""
    ),

    (
        r"""((?:^|\s)[эЭ])фект""",
        r"""\1ффект"""
    ),

    (
        r"""((?:^|\s)[яЯ])кори\b""",
        r"""\1коря"""
    ),

    (
        r"""([аА])(бба|ген|гна|двока|дъюнк|дъютан|кроба|мана|нахоре|ристокра|рхимандри|спиран)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([бБ])(анкро|анкру|ароне|езграмо|езде|езотве|есносвя|еспамя|еспрепя|еспу|лагоприве|лагоприя|ога)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([вВ])(ероотме|заимоотве|идеопира|иршеплё|иршепле|олоки|оспрепя|себра|сесвя|ьюни)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([гГ])(оттенто)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([дД])(вубра|екаден|епута|еся|илетан|иссиден|оброхо|олголе|онкихо|оцен)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([жЖ])(ени|ивогло|изнепрису|мо)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([зЗ])(апанибра|вездоче|лобы|лопамя)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([иИ])(дио|езуи|ллюмина|мени|ндепенден|нститу|нтеллиген|нтендан|нформаген|покри|скарио)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([кК])(андида|апитулян|астра|вартиран|верулян|огна|оке|омедиан|омендан|онтраген|ришнаи)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([лЛ])(ауреа|ега|юбопы)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([мМ])(агна|айора|алоле|аркиза|аркитан|ецена|ногобра|ноголе|огу|онофели|онофизи|онофиси)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([нН])(аве|апу|еблагоприя|едоброхо|езлопамя|екру|елюбопы|енасы|епамя|епрепя|еприя|есоотве)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([оО])(днобра|пря|тве|тсу|фи)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([пП])(анибра|арази|асквилян|атрона|едан|ервобра|ервопрису|ира|лу|облагоприя|олубеспамя|олусиро|рактикан|резиден|рела|репя|ресвя|риве|рису|рия|розели|рокля|ролетариа|ротестан|устосвя|ы)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([рР])(адиопира|аспу|ебя|еген|езиден|екру|енега|еформа|ецензен|ифмоплё|ифмопле|удозна)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([сС])(амобра|амохо|вятота|ектан|ибари|иро|коробога|коробра|ледопы|обра|олда|оотве|опрису|опу|пекулян|рамо|тихоплё|тихопле|тропо|уббо|уесвя|уе)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([тТ])(а|езоимени|рансаген|ураген)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([уУ])(ниа|ю)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([фФ])(а|лагеллан)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([чЧ])(етверобра)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([шШ])(алопу|ляхе)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([эЭ])(мигран|сте)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""([юЮ])(но)т?ст?в""",
        r"""\1\2тств"""
    ),

    (
        r"""((?:^|\s)(?:[сС]емь|[сС]тать|[сС]удь|[сС]камь|[зЗ]емл|[зЗ]ме|[сС]винь|[бБ]рон|[чЧ]ешу))ей\b""",
        r"""\1ёй"""
    ),

    (
        r"""((?:^|\s)(?:[сС]во|[дД]н|[вВ]дво|[кК]он|[кК]опь|[жЖ]иль))ем\b""",
        r"""\1ём"""
    ),

    (
        r"""((?:^|\s)(?:[рР]азреш|[зЗ]апре[щш]|[вВ]нес|[оО]тклон))ен(\b|н)""",
        r"""\1ён\2"""
    ),

    (
        r"""((?:^|\s)[аА])ктер""",
        r"""\1ктёр"""
    ),

    (
        r"""((?:^|\s)[бБ])ерез([ауеы]|ой|а[мх]|ами|ов[А-ЯЁа-яё]{2,3})?\b""",
        r"""\1ерёз\2"""
    ),

    (
        r"""((?:^|\s)[бБ])ъ[её]т""",
        r"""\1ьёт"""
    ),

    (
        r"""((?:^|\s)(?:[вВоО]|[нН]а|[пП]ри))\sнем\b""",
        r"""\1 нём"""
    ),

    (
        r"""((?:^|\s)[вВ])арен(ая|о([ейю]|го|му?)|ы([ейх]|ми?)|ую)\b""",
        r"""\1арён\2"""
    ),

    (
        r"""((?:^|\s)[вВ])ертолет""",
        r"""\1ертолёт"""
    ),

    (
        r"""([вВ])люблен(?![аоыи])""",
        r"""\1люблён"""
    ),

    (
        r"""([вВ])ооружен(?![иаоы])""",
        r"""\1ооружён"""
    ),

    (
        r"""((?:^|\s)[вВ])перед\b""",
        r"""\1перёд"""
    ),

    (
        r"""((?:^|\s)[вВ])ремен\b""",
        r"""\1ремён"""
    ),

    (
        r"""((?:^|\s)[вВ])се\sбольш([ие][йю]|ая|е[гме])""",
        r"""\1сё больш\2"""
    ),

    (
        r"""((?:^|\s)[вВ])с[её]-?\s*таки\b""",
        r"""\1сё-таки"""
    ),

    (
        r"""((?:^|\s)[гГ])осподарём\b""",
        r"""\1осподарем"""
    ),

    (
        r"""((?:^|\s)[нН]е)?([дД])алек(и[ймех]|ого|ому?|ая|о[йе]|ую|ими)\b""",
        r"""\1\2алёк\3"""
    ),

    (
        r"""((?:^|\s)[дД])ешев(ы[еймх]|ого|ому?|ая|о[ейю]|ую|ыми?|к[аие])\b""",
        r"""\1ешёв\2"""
    ),

    (
        r"""((?:^|\s)[дД])ешев([оы]?)\b""",
        r"""\1ёшев\2"""
    ),

    (
        r"""((?:^|\s)[дД])[еи]р[еи]ж[еёо]р""",
        r"""\1ирижёр"""
    ),

    (
        r"""((?:^|\s)[нН]?)([еЕ])е\b""",
        r"""\1\2ё"""
    ),

    (
        r"""((?:^|\s)[еЕ])[шщ]е\b""",
        r"""\1щё"""
    ),

    (
        r"""((?:^|\s)[жЖ])еребен""",
        r"""\1еребён"""
    ),

    (
        r"""((?:^|\s)[жЖ])[ое]лт((ая|о[ейюм]|го|ы[ейхм]|ую)\b|о-)""",
        r"""\1ёлт\2"""
    ),

    (
        r"""([жЖ])[ое]стк(и[еймх]|ая|о[еймю]?|ому|ую|ого|ими|ости|остью?|остей|остями?|остях)\b""",
        r"""\1ёстк\2"""
    ),

    (
        r"""((?:^|\s)[зЗ])асч[её]т\b""",
        r"""\1а счёт"""
    ),

    (
        r"""креплен(\b|н)""",
        r"""креплён\1"""
    ),

    (
        r"""((?:^|\s)[зЗ])елен((ая|о[еймю]|ого|ы[ейхм]|ую)\b|о-)""",
        r"""\1елён\2"""
    ),

    (
        r"""((?:^|\s)(?:[пП]о|[зЗ]а))чет(?!т)""",
        r"""\1чёт"""
    ),

    (
        r"""((?:^|\s)[иИ])зм[еи]нен(\b|н)""",
        r"""\1зменён\2"""
    ),

    (
        r"""((?:^|\s)(?:[иИ]м|[эЭ]кс))портер""",
        r"""\1портёр"""
    ),

    (
        r"""((?:^|\s)[кК])азнен(?![аоы])""",
        r"""\1азнён"""
    ),

    (
        r"""((?:^|\s)[Кк])ишинев""",
        r"""\1ишинёв"""
    ),

    (
        r"""((?:^|\s)[кК])ороле([км])\b""",
        r"""\1оролё\2"""
    ),

    (
        r"""((?:^|\s)[Нн]ел|[лЛ])егк(и[еймх]|ая|о[еймю]|ому|ую|ого|ими)\b""",
        r"""\1ёгк\2"""
    ),

    (
        r"""((?:^|\s)[лЛ])етчик""",
        r"""\1ётчик"""
    ),

    (
        r"""((?:^|\s)[мМ])аневр(?![ио])""",
        r"""\1анёвр"""
    ),

    (
        r"""((?:^|\s)[мМ])ертв(ы[ейхм]|ого|ому?|ая|о[ейю]|ую|ыми)\b""",
        r"""\1ёртв\2"""
    ),

    (
        r"""((?:^|\s)[мМ])иномет""",
        r"""\1иномёт"""
    ),

    (
        r"""((?:^|\s)[Мм])огилев(?![сце])""",
        r"""\1огилёв"""
    ),

    (
        r"""((?:^|\s)[мМ])олодеж""",
        r"""\1олодёж"""
    ),

    (
        r"""((?:^|\s)(?:[нН]а\s|[пП]ри))чем\b""",
        r"""\1чём"""
    ),

    (
        r"""гражден(?![иаоы])""",
        r"""граждён"""
    ),

    (
        r"""([нН])адеж(?![ди])""",
        r"""\1адёж"""
    ),

    (
        r"""((?:^|\s)[нН])амек(?!а[етюляв]|н)""",
        r"""\1амёк"""
    ),

    (
        r"""((?:^|\s)[нН])аселенн(?![яюі])""",
        r"""\1аселённ"""
    ),

    (
        r"""((?:^|\s)[оО]т|[пП]ри|[зЗнН]а|[уУ]|[пП]ере|[сС]|[дД]о)([нН])ес(\b|ш)""",
        r"""\1\2ёс\3"""
    ),

    (
        r"""((?:^|\s)[нН])[ие]\s?при\s?ч[её]м""",
        r"""\1и при чём"""
    ),

    (
        r"""ночевк""",
        r"""ночёвк"""
    ),

    (
        r"""((?:^|\s)[оО])б[ьъ]ед[ие]ненн""",
        r"""\1бъединённ"""
    ),

    (
        r"""((?:^|\s)[оО])б[ъь]?[её]м(а(?:ми?|х)?|[уеын]|о[вм]?)\b""",
        r"""\1бъём\2"""
    ),

    (
        r"""((?:^|\s)[оО])дноименн""",
        r"""\1дноимённ"""
    ),

    (
        r"""([оО])сведомлен(?![аоыи])""",
        r"""\1сведомлён"""
    ),

    (
        r"""((?:^|\s)[оО])(т?)стает(ся)?\b""",
        r"""\1\2стаёт\3"""
    ),

    (
        r"""([сС])оединенн""",
        r"""\1оединённ"""
    ),

    (
        r"""((?:^|\s)[оО])зер(\b|а[мх]и?)""",
        r"""\1зёр\2"""
    ),

    (
        r"""((?:^|\s)[оО])ленек\b""",
        r"""\1ленёк"""
    ),

    (
        r"""([оО])пределен(\b|н)""",
        r"""\1пределён\2"""
    ),

    (
        r"""сужден(\b|н)""",
        r"""суждён\1"""
    ),

    (
        r"""((?:^|\s)(?:[уУ]|[оО]т))чет(?!вер)""",
        r"""\1чёт"""
    ),

    (
        r"""бежден(?![аоыи])""",
        r"""беждён"""
    ),

    (
        r"""((?:^|\s)[пП])овлек(\b|ш)""",
        r"""\1овлёк\2"""
    ),

    (
        r"""твержден(?![аоыи])""",
        r"""тверждён"""
    ),

    (
        r"""((?:^|\s)[пП])од[ъь]?[её]м(а(?:ми?|х)?|[уеын]|о[вм]?)\b""",
        r"""\1одъём\2"""
    ),

    (
        r"""([пП]ри|[пП]ровоз)глашен(?![аоыи])""",
        r"""\1глашён"""
    ),

    (
        r"""((?:^|\s)[пП]ри|[оО]т|[вВ]ы|[пП]ере|[пП]од|[оО]б|[рР]аз|[сС]|[сС]оз|[нН]ад|[нН]едо)?([дД])ает(ся)?\b""",
        r"""\1\2аёт\3"""
    ),

    (
        r"""((?:^|\s)[пП])р[еи]зер(а(?:ми?|х)?|[уеы]|о[мв]?)\b""",
        r"""\1ризёр\2"""
    ),

    (
        r"""((?:^|\s)[пП])ролет(ах?|[еуы]|о[мв]|ами?)?\b""",
        r"""\1ролёт\2"""
    ),

    (
        r"""((?:^|\s)[пП])улемет""",
        r"""\1улемёт"""
    ),

    (
        r"""((?:^|\s)[рР])азветл([её])н""",
        r"""\1азветвл\2н"""
    ),

    (
        r"""((?:^|\s)[рР])азвернут(?!ь)""",
        r"""\1азвёрнут"""
    ),

    (
        r"""((?:^|\s)[рР])аспр?остерт""",
        r"""\1аспростёрт"""
    ),

    (
        r"""([рР])аспр?остранен(?![иаоы])""",
        r"""\1аспространён"""
    ),

    (
        r"""([рР])ассеченн""",
        r"""\1ассечённ"""
    ),

    (
        r"""([рР])асчет""",
        r"""\1асчёт"""
    ),

    (
        r"""((?:^|\s)[рР])ебен([ок])""",
        r"""\1ебён\2"""
    ),

    (
        r"""([рР])[ие]ж[ие]сс?[её]р""",
        r"""\1ежиссёр"""
    ),

    (
        r"""((?:^|\s)[рР])ешетк""",
        r"""\1ешётк"""
    ),

    (
        r"""([рР])ожденн(?!и)""",
        r"""\1ождённ"""
    ),

    (
        r"""((?:^|\s)[рР])укоположен(?![иаоы])""",
        r"""\1укоположён"""
    ),

    (
        r"""((?:^|\s)[сС])амолет""",
        r"""\1амолёт"""
    ),

    (
        r"""((?:^|\s)[сС])вое\b""",
        r"""\1воё"""
    ),

    (
        r"""([сС])[еи]р[ьъ]езн""",
        r"""\1ерьёзн"""
    ),

    (
        r"""((?:^|\s)[сС])естер\b""",
        r"""\1естёр"""
    ),

    (
        r"""([сС])к[ур][ру]пул[её]зн""",
        r"""\1крупулёзн"""
    ),

    (
        r"""([сС])[ьъ]ем(о?)([кнчщ])""",
        r"""\1ъём\2\3"""
    ),

    (
        r"""((?:^|\s)[сС])чет(е|ом)\b""",
        r"""\1чёт\2"""
    ),

    (
        r"""([сС])чет\b""",
        r"""\1чёт"""
    ),

    (
        r"""((?:^|\s)[тТ])аежн""",
        r"""\1аёжн"""
    ),

    (
        r"""((?:^|\s)[тТ])верд(ы[ейх]|ая|о[ейм]|ому|ую|ого|ыми?)""",
        r"""\1вёрд\2"""
    ),

    (
        r"""((?:^|\s)[тТ])емн((ы[ейхм]|ая|о[ейюм]|ого|ую)\b|о-)""",
        r"""\1ёмн\2"""
    ),

    (
        r"""((?:^|\s)(?:т|[чЧ]еты))ре([хм])(?![яи]|о[лр]|ат|арн)""",
        r"""\1рё\2"""
    ),

    (
        r"""([тТ])яж[ое]л(ы[ейх]|ая|о[ейм]|ому|ую|ого|ыми?)\b""",
        r"""\1яжёл\2"""
    ),

    (
        r"""даленн""",
        r"""далённ"""
    ),

    (
        r"""((?:^|\s)[уУ])празднен(\b|н)""",
        r"""\1празднён\2"""
    ),

    (
        r"""((?:^|\s)[уУ])чеб([аеуы]|ой)\b""",
        r"""\1чёб\2"""
    ),

    (
        r"""((?:^|\s)[уУ])чен(ы[йемх]|ого|ому?|ая|о[йе]|ую|ыми)""",
        r"""\1чён\2"""
    ),

    (
        r"""((?:^|\s)[чЧ])етверт(ая|о[гейм]|ы[еймх])""",
        r"""\1етвёрт\2"""
    ),

    (
        r"""((?:^|\s)(?:[нН]е)?[чЧ])етк""",
        r"""\1ётк"""
    ),

    (
        r"""([шШ])епот(?!н[яюеиё]|ок|ко|ат)""",
        r"""\1ёпот"""
    ),

    (
        r"""([пП]р[ио]|[нНзЗ]а|[уУ]|[вВдД]о|[оО]то)шел(ся)?\b""",
        r"""\1шёл\2"""
    ),

    (
        r"""((?:^|\s)[шШ])офер([уеы]|о[мв]|ами?|ах)""",
        r"""\1офёр"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))([бБ])рошур(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1рошюр"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))\b([бБ])[юие]лл?[еюи]тен(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1юллетен"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))([ау])([ею])ться(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1\2тся"""
    ),

    (
        r"""(?<=(?:[^іІўЎґҐ]{30}))([дД])аку?мент(?=(?:[^іІўЎґҐ]{30}))""",
        r"""\1окумент"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))\b([кК])омм?унн?(?!\b|аль\b|ан|ар[ди]|ерос|и[гд]|икас)(?=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))""",
        r"""\1оммун"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))([кК])ореспон?ден(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1орреспонден"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))\b([мМ])олюск(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1оллюск"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))([оО])бласнт?(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1бластн"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))\b([оО])куп(ир|ац)(?=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))""",
        r"""\1ккуп\2"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))\b([оО])позиц(?=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))""",
        r"""\1ппозиц"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))([пП])аралл?елл?(?=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))""",
        r"""\1араллел"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))\b(?!Партнершип)([пП])артнер(?=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))""",
        r"""\1артнёр"""
    ),

    (
        r"""(?<=(?:[^ђЂjЈљЉњЊЋћџЏ]{30}\b))([пП])реправ(?=(?:[^ђЂjЈљЉњЊЋћџЏ]{30}))""",
        r"""\1ереправ"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))\b([пП])роцес(?!с)(?=(?:[^іїєґІЇЄҐukђЂjЈљЉњЊЋћџЏ]{30}))""",
        r"""\1роцесс"""
    ),

    (
        r"""(?<=(?:[^іІўЎґҐ]{30}))([рР])аён(?=(?:[^іІўЎґҐ]{30}))""",
        r"""\1айон"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))\b([пП]ерво)?([Сс])вященик(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1\2вященник"""
    ),

    (
        r"""(?<=(?:[^іїєґІЇЄҐuk]{30}))\b([уУ])часник(?=(?:[^іїєґІЇЄҐuk]{30}))""",
        r"""\1частник"""
    ),

    (
        r"""(?<=(?:[^іІўЎґҐ]{30}))([фФ])ранцус?[зс]к(?=(?:[^іІўЎґҐ]{30}))""",
        r"""\1ранцузск"""
    ),

    (
        r"""(?<=(?:[^әӘғҒқҚңҢөӨұҰүҮҺһіІ]{30}))([шШ])ахтер(?=(?:[^әӘғҒқҚңҢөӨұҰүҮҺһіІ]{30}))""",
        r"""\1ахтёр"""
    ),

]


def fix_typos(text):
    for pattern, replacement in TYPO_RULES:
        try:
            text = re.sub(
                pattern,
                replacement,
                text
            )
        except (re.error, ValueError):
            continue

    return text